{
  "latest": [
    {
      "uri":"spotify:album:0fUy6IdLHDpGNwavIlhEsl",
      "about":"Dirty Sprite 2 brushes aside the pop overtures of Future's sophomore album Honest. Building off a powerful three-mixtape comeback run, DS2 is bleak and unforgiving, a redemption story for a man who is certain it’s too late for his soul to be redeemed; instead of a triumphal arc, we burrow deeper and deeper into Future’s dystopian universe. This is music for nihilists, for the reckless, for those who embrace darkness because they don’t see another option."
    },
    {
      "uri":"spotify:album:79dL7FLiJFOO0EoehUHQBv",
      "about":"Nearly every song on Currents is a statement of leader Kevin Parker's range and increasing expertise as a producer, arranger, songwriter, and a vocalist. Parker is writing pop songs here, and doing them justice, and Currents is the result of a supernaturally talented obsessive trying to perfect music. The album ends up being Parker's most convincing case for solitude yet—he knows perfection can be achieved only inside the studio and that progress is the ultimate goal outside of it."
    },
    {
      "uri":"spotify:album:6b5WANFyoXhaMTXPqLF6ez",
      "about":"On Wildheart, Miguel makes good on all of his cross-genre dabbling of the past five years. The album soars with shiny guitar lines and sky-high vocals, while the pompadoured singer explores a sex-positive attitude that focuses on pleasure and partnership instead of one-sided pursuit. If Frank Ocean is young soul's prismatic, consciousness-expanding Marvin Gaye, Miguel's the reliable Al Green."
    },
    {
      "uri":"spotify:album:4Csoz10NhNJOrCTUoPBdUD",
      "about":"Vince Staples' first full-length for Def Jam is brilliant. The Long Beach rapper expresses complex ideas in plain, hard sentences, ones that can be handed to you like a pamphlet. His rapping is conversational, but these are the conversations you have when all optimism has been burned away. Summertime '06 was overseen by Dion \"No I.D.\" Wilson, one-time mentor to Kanye and the force behind all of Def Jam’s best projects for years now. No I.D. seems to grasp the essence of every track he works on; music that has borne his attention almost always emerges with its worldview clarified. On Summertime '06, he turns an album produced largely by himself, DJ Dahi, and Clams Casino into one tense, seething organism, making it difficult to isolate which songs these wildly different musicians worked on."
    }
  ],
  "classics": [
    {
      "uri":"spotify:album:7vgpBNK5xPmS3Mu2Hl9O0D",
      "about":"Stevie Wonder's second album this year is in many ways a reprise with variations of the first, Music of My Mind. Both are ambitious, richly-textured, almost entirely the work of Wonder himself, who produced (with assistance, primarily on the Moog work, from Malcolm Cecil and Robert Margouleff), composed the music and all but a few of the lyrics, plays the bulk of the instrumental tracks (aided here and there on Talking Book by eight musicians including, on one cut, Jeff Beck and Buzzy Feiten) and sings densely multi-tracked. Both albums carry Wonder's music into a new mode, a vigorous, complex style based in Stevie's experiment's with the synthesizers and his at once playful and assured use of studio techniques. What flaws there were in Music of My Mind resulted from an overindulgence in techniques, a sort of let's-see-how-this-sounds fascination with gimmickry which seems to have been brought under control in the new album. So Talking Book is more relaxed, dreamy at times, the laid-back funk of the vocals resting on a deliciously liquid instrumental track like a body on a waterbed. Yet there's never a lack of energy: Even at its dreamiest, the music has a glowing vibrancy. Talking Book, then, is an extension and refinement of the work begun in Music of My Mind (itself a vast refinement of the uneven efforts in Where I'm Coming From), confirming the achievement and getting more comfortable with it. Making it all seem quite effortless, Wonder has produced another of the very best albums this year."
    },
    {
      "uri":"spotify:album:5Y0p2XCgRRIjna91aQE8q7",
      "about":"Meat Is Murder may have been a holding pattern, but The Queen Is Dead is the Smiths' great leap forward, taking the band to new musical and lyrical heights. Opening with the storming title track, The Queen Is Dead is a harder-rocking record than anything the Smiths had attempted before, but that's only on a relative scale -- although the backbeat is more pronounced, the group certainly doesn't rock in a conventional sense. Instead, Johnny Marr has created a dense web of guitars, alternating from the minor-key rush of buskBigmouth Strikes Againbusk and the faux rockabilly of buskVicar in a Tutubusk to the bouncy acoustic pop of buskCemetry Gatesbusk and buskThe Boy With the Thorn in His Side,busk as well as the lovely melancholy of buskI Know It's Overbusk and buskThere Is a Light That Never Goes Out.busk And the rich musical bed provides Morrissey with the support for his finest set of lyrics. Shattering the myth that he is a self-pitying sap, Morrissey delivers a devastating set of clever, witty satires of British social mores, intellectualism, class, and even himself. He also crafts some of his finest, most affecting songs, particularly in the wistful buskThe Boy With the Thorn in His Sidebusk and the epic buskThere Is a Light That Never Goes Out,busk two masterpieces that provide the foundation for a remarkable album."
    },
    {
      "uri":"spotify:album:0cszZwl0JRKHBdcFLfNX3T",
      "about":"Often cited as one of the best hip-hop albums of the '90s, Illmatic is the undisputed classic upon which Nas' reputation rests. It helped spearhead the artistic renaissance of New York hip-hop in the post-Chronic era, leading a return to street aesthetics. Yet even if Illmatic marks the beginning of a shift away from Native Tongues-inspired alternative rap, it's strongly rooted in that sensibility. For one, Nas employs some of the most sophisticated jazz-rap producers around: Q-Tip, Pete Rock, DJ Premier, and Large Professor, who underpin their intricate loops with appropriately tough beats. But more importantly, Nas takes his place as one of hip-hop's greatest street poets -- his rhymes are highly literate, his raps superbly fluid regardless of the size of his vocabulary. He's able to evoke the bleak reality of ghetto life without losing hope or forgetting the good times, which become all the more precious when any day could be your last. As a narrator, he doesn't get too caught up in the darker side of life -- he's simply describing what he sees in the world around him, and trying to live it up while he can. He's thoughtful but ambitious, announcing on buskN.Y. State of Mindbusk that buskI never sleep, 'cause sleep is the cousin of death,busk and that he's buskout for dead presidents to represent mebusk on buskThe World Is Yours.busk Elsewhere, he flexes his storytelling muscles on the classic cuts buskLife's a Bitchbusk and buskOne Love,busk the latter a detailed report to a close friend in prison about how allegiances within their group have shifted. Hip-hop fans accustomed to 73-minute opuses sometimes complain about Illmatic's brevity, but even if it leaves you wanting more, it's also one of the few '90s rap albums with absolutely no wasted space. Illmatic reveals a great lyricist in top form meeting great production, and it remains a perennial favorite among serious hip-hop fans."
    },
    {
      "uri":"spotify:album:5z8bPdGFiJx56cqsHTvWM9",
      "about":"Sonic Youth made a major step forward with 1987's Sister, their first album where the songs were as strong as the group's visionary approach and they rocked with the force and authority they'd clearly sought since the beginning. If 1988's Daydream Nation didn't make as decisive a leap in terms of theory or style, as far as execution was concerned, it was Sonic Youth's first unqualified masterpiece, a triumph that made them one of the most respected bands in indie rock. Initially released as a two-LP set, the sheer scope of Daydream Nation was ambitious, but the longer tracks worked to Sonic Youth's advantage, allowing them the space to lay down solid melodic structures and then use them as a framework for extended jams (thankfully, the band made splendid use of their wanderlust without wearing out their welcome). Sonic Youth were playing at the top of their game on the Daydream Nation sessions; the guitar interplay between Thurston Moore and Lee Ranaldo was stronger and more intuitive than before, and bassist Kim Gordon and drummer Steve Shelley had grown into a powerful rhythm section that cut an impressive groove, giving the band a greater freedom to explore the space around them without getting lost. Sonic Youth were not simply tighter on Daydream Nation, they were making better and more satisfying use of their arsenal of alternate tunings and bent but elemental song structures, and the final product fused their love of creatively applied noise and the sound of the electric guitar with song structures that merged elements of punk, prog, boogie, and psychedelia. The journey from the trippy joy of buskTeenage Riotbusk to the hot-rodded choogle of buskEliminator Jr.busk was a bracing, glorious experience, and Daydream Nation confirmed their status as one of America's best and most original alternative rock bands, and one that had a shot at a future outside the underground -- a pleasant surprise given the alienating air of their earliest work."
    }
  ]
}
